#include <stdio.h>

int countSequences(int n) {
    int dp[n+1]; // Масив для зберігання кількості послідовностей довжиною i

    // Ініціалізація базових значень
    dp[0] = 1;
    dp[1] = 2;
    dp[2] = 4;

    int i;
    for (i = 3; i <= n; i++) {
        // Рекурентна формула для обчислення кількості послідовностей
        dp[i] = (dp[i-1] + dp[i-2] + dp[i-3]) % 12345;
    }

    return dp[n];
}

int main() {
    int n;

    // Ввід довжини послідовностей
    printf("Введіть довжину послідовностей n: ");
    scanf("%d", &n);

    // Підрахунок кількості послідовностей
    int result = countSequences(n);

    // Виведення результату
    printf("Кількість шуканих послідовностей: %d\n", result);

    return 0;
}
